rtzaudio/STC1200_TivaTM4C1294NCPDT/LocateTask.c
        /* Set transport to STOP mode initially */
        Transport_Stop();

        /* Save cue from point distance */
        cue_from = g_sysData.cuePoint[cue_index].ipos - g_sysData.tapePosition;

        if (!cue_from)
            cue_from = 1;

        /* Clear the global search cancel flag */
        key = Hwi_disable();
        g_sysData.searching = TRUE;
        g_sysData.looping = looping;
        g_sysData.searchCancel = FALSE;
        g_sysData.searchProgress = 0;
        Hwi_restore(key);

        /* Send TCP state change notification */
        //Event_post(g_eventTransport, Event_Id_00);

        /**************************************/
        /* BEGIN MAIN AUTO-LOCATE SEARCH LOOP */
        /**************************************/

        state = LOCATE_START_STATE;

        done = FALSE;

	    while (!done)
	    {
	        float time;
            float velocity;

            /* Abort if transport halted, must be tape out? */
            if (IsTransportHaltMode())
                break;

			/* Get the signed absolute position(distance) cue_from the cue point */
            cue_dist = g_sysData.cuePoint[cue_index].ipos - g_sysData.tapePosition;

            abs_dist = abs(cue_dist);

			/* v = d/t */
			if ((velocity = g_sysData.tapeTach) < 1.0f)
			    velocity = 1.0f;

			/* d = v * t */
			/* t = d/v */
			time = (float)abs_dist / velocity;

			/* Calculate the search progress as percentage */

            float progress = fabs(((float)cue_dist / cue_from) * 100.0f);

            if (progress > 100.0f)
                progress = 100.0f;

            if (progress < 0.0f)
                progress = 0.0f;

            g_sysData.searchProgress = 100 - (int32_t)progress;

#if (TTY_DEBUG_MSGS > 0)
            //if (state >= LOCATE_SHUTTLE_FAR)
            //    CLI_printf("d=%d, t=%u, v=%u\n", cue_dist, (uint32_t)time, (uint32_t)velocity);
#endif
			/*
			 * SEARCH FINITE STATE MACHINE
			 */

            /* Send TCP state change notification */
            Event_post(g_eventTransport, Event_Id_00);

			switch(state)
			{
			case LOCATE_START_STATE:

			    /* Determine which direction we need to go initially */
#if (TTY_DEBUG_MSGS > 0)
			    CLI_printf("\nBEGIN LOCATE[%u] ", cue_index);
#endif
			    if (g_sysData.cuePoint[cue_index].ipos > g_sysData.tapePosition)
		        {
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("FWD > ");
#endif
		            dir = DIR_FWD;
		        }
		        else if (g_sysData.cuePoint[cue_index].ipos < g_sysData.tapePosition)
		        {
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("REW < ");
#endif
		            dir = DIR_REW;
		        }
		        else
		        {
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("AT ZERO!!\n");
#endif
                    done = TRUE;
		            dir = DIR_ZERO;
		            break;
		        }

			    /* Determine the shuttle speed range based on distance out */

			    if (abs_dist > 9000)
                {
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("FAR");
#endif
                    shuttle_vel = JOG_VEL_FAR;
                    state = LOCATE_SHUTTLE_FAR;
                }
                else if (abs_dist > 3000)
                {
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("MID");
#endif
                    shuttle_vel = JOG_VEL_MID;
                    state = LOCATE_SHUTTLE_MID;
                }
                else
                {
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("NEAR");
#endif
                    shuttle_vel = JOG_VEL_NEAR;
                    state = LOCATE_SHUTTLE_NEAR;
                }

                //CLI_printf(" d=%d, t=%d\n", cue_dist, (int32_t)time);

                /* Start the transport in either FWD or REV direction
		         * based on the cue point and current location. We set
		         * the M_NOSLOW so the DTC auto-slow function will be
		         * disabled for the shuttle command requested.
		         */
                if (dir == DIR_FWD)
		            Transport_Fwd(shuttle_vel, M_NOSLOW);
		        else
		            Transport_Rew(shuttle_vel, M_NOSLOW);
			    break;

            case LOCATE_SHUTTLE_FAR:

                if (time < 110.0f)
			    {
                    state = LOCATE_BRAKE_VELOCITY;

	                if (velocity > 35.0f)
	                {
#if (TTY_DEBUG_MSGS > 0)
                        CLI_printf("SHUTTLE FAR BRAKE STATE d=%d\n", cue_dist);
#endif
	                    state = LOCATE_BRAKE_STATE;
	                }
			    }
			    break;

            case LOCATE_SHUTTLE_MID:

                if (time < 70.0f)
                {
                    state = LOCATE_BRAKE_VELOCITY;

                    if (velocity > 35.0f)
                    {
#if (TTY_DEBUG_MSGS > 0)
                        CLI_printf("SHUTTLE MID BRAKE STATE d=%d\n", cue_dist);
#endif
                        state = LOCATE_BRAKE_STATE;
                    }
                }
                break;

            case LOCATE_SHUTTLE_NEAR:

                if (time < 30.0f)
                {
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("SHUTTLE NEAR BRAKE STATE d=%d\n", cue_dist);
#endif
                    state = LOCATE_BRAKE_VELOCITY;
                }
                break;

            case LOCATE_BRAKE_STATE:

                //CLI_printf("CHECK BRAKE STATE: d=%d, t=%d, v=%u\n", abs_dist, (int32_t)time, (uint32_t)velocity);

                if (velocity > 30.0f)
                {
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("BEGIN DYNAMIC BRAKE: v=%u\n", (uint32_t)velocity);
#endif
                    Transport_Stop();

                    state = LOCATE_BRAKE_VELOCITY;
                }
                else
                {
#if (TTY_DEBUG_MSGS > 0)
                    CLI_printf("BEGIN COAST BRAKE: v=%u\n", (uint32_t)velocity);
#endif
                    /* Begin low speed shuttle */
                    if (dir == DIR_FWD)
                        Transport_Fwd(SHUTTLE_SLOW_VEL, M_NOSLOW);
                    else
                        Transport_Rew(SHUTTLE_SLOW_VEL, M_NOSLOW);

                    state = LOCATE_ZERO_CROSS;
                }

